app/controllers/articles_controller.rb

	def update
		@article = Article.find(params[:id])

		if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "asdasd"], ["text", "as"], ["updated_at", "2018-09-15 12:27:13.431712"], ["id", 2]]